package lr4;

public class Example1 {
    public static void main(String[] args) {
        int height = 11;
        int width = 23;

        for (int i = 0; i < height; i++) {
            for (int j = 0; j < width; j++) {
                System.out.print("*");
            }
            System.out.println();
        }

    }
}


/* 1.	Напишите программу, которая выводить в консольное окно прямоугольник,
размеры сторон которого, ширина: 23 колонки, высота: 11 строк; */